#include <stdio.h>
#include <math.h>

void main() {
  double x, y, t, t1, t2, w1, w2, r1, r2;
  t1 = 687; // период обращения Марса в днях
  t2 = 365.25; // период обращения Земли в днях
  r1 = 227900000; // расстояние от Марса до Солнца в км
  r2 = 149600000; // расстояние от Земли до Солнца в км
  w1 = 2 * M_PI / t1;
  w2 = 2 * M_PI / t2;

  for (t = 0; t <= 365; ++t) {
    x = r1 * cos(w1 * t) - r2 * cos(w2 * t);
    y = r1 * sin(w1 * t) - r2 * sin(w2 * t);
    printf("X = %-12lg Y = %-12lg\n", x, y);
  }
}
